choice = 0
while choice != "4":
    choice = input("""\nВиберіть ваш варіант: 
1 - Порахувати ІМТ
2 - Інформація про ІМТ
3 - Інформація про розробника
4 - Вийти
Ваш вибір: """)
    if choice == "1":
        import math

        mass = int(input("Ведіть вашу вагу, кг: "))
        height = int(input("Ведіть ваш зріст, см: "))
        nbw = (mass / (height / 100) ** 2)
        print("\nВаш ІМТ: ", round(nbw, 2))
        if (nbw <= 16):
            print("\nТвоя маса тіла є критичною, піди поїж!")
        if (nbw >= 16 and nbw <= 18
        ):
            print("\nТвоя маса тіла є недостатньою, тримай булочку)")
        if (nbw >= 18 and nbw <= 25):
            print("\nТвоя маса тіла є нормальною, відпочивай)")
        if (nbw >= 25 and nbw <= 30):
            print("\nЄ трішки зайвої ваги, йди в зал)")
        if (nbw > 30):
            print("\nОжиріння!!!!")

        choice2 = input("\nНатисніть будь-яку клавішу... ")

    if choice == "2":
        print("Показник ІМТ, кг/м2        Ознака\n\n"
              "Менше 18.5                 свідчить про недостатню вагу\n"
              "18,5-24,9                  еквівалент нормальної маси тіла\n"
              "25,0-29,9                  вказує на наявність зайвої ваги\n"
              "Понад 30                   є ознакою ожиріння")

        choice2 = input("\nНатисніть будь-яку клавішу... ")

    if choice == "3":
        print("\n  Інформація:\n"
              "Version: v2.5\n""©BOMBA Production\n""Created by: Antot_12")
        choice2 = input("\nНатисніть будь-яку клавішу... ")
